Autodesk.Revit.DB.CompoundStructureError
When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.
Since:
2012

Autodesk.Revit.DB.CompoundStructureError.LayerTooThin
Layers with non-zero thickness is less than a minimum thickness.